#language: ru

@Android
@GroupSelectPageElementsCheck

Функционал: Интерфейс

  Сценарий: Проверка отображения элементов на странице выбора группы
    Дано открывается приложение
    Тогда нажимается элемент "Кнопка Настройки"
    И отображается элемент "Кнопка Выбор группы"
    И отображается элемент "Кнопка Назад"
    И отображается элемент "Текст МУИВ в меню выбора группы"
    И нажимается элемент "Кнопка Выбор группы"
    И отображается элемент "Текст Select Item"
    И отображается элемент "Инпут для группы"
    И отображается элемент "Иконка для поиска"
    И отображается элемент "Список групп"
    И отображается элемент "Кнопка Закрыть выбор группы"