#language: ru

@Android
@MainPageElementsCheck
Функционал: Интерфейс

  Сценарий: Проверка отображения элементов на главной странице
    Дано открывается приложение
    Тогда отображается элемент "Текст Расписание Занятий"
    И отображается элемент "Текст Текущий день"
    И отображается элемент "Расписание на текущий день"
    И отображается элемент "Кнопка На неделю"
    И отображается элемент "Кнопка Настройки"
    И отображается элемент "Кнопка Авторизации"
    И отображается элемент "Кнопка Раскрыть меню"
    И отображается элемент "Текст МУИВ в главном меню"