#language: ru

@Android
@LoginPageElementsCheck

Функционал: Интерфейс

  Сценарий: Проверка отображения элементов на странице авторизации
    Дано открывается приложение
    Тогда нажимается элемент "Кнопка Авторизации"
    И отображается элемент "Текст Введите логин"
    И отображается элемент "Инпут для логина"
    И отображается элемент "Инпут для пароля"
    И отображается элемент "Кнопка Проверка"
    И отображается элемент "Кнопка Далее"
    И отображается элемент "Кнопка Назад"
    И отображается элемент "Текст МУИВ в меню авторизации"